index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-05 Sun 21:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python for Finance</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python for Finance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org03b3228">Introduction</a></li>
<li><a href="#org2cbdbea">Module 0: Setup</a>
<ul>
<li><a href="#orgb02b922">Session 0</a></li>
<li><a href="#org78b3e96">Session 1</a></li>
<li><a href="#orgcc77efb">Session 2</a></li>
</ul>
</li>
<li><a href="#orgc24d1bb">Module 1: Pandas and Spreadsheet Data</a>
<ul>
<li><a href="#org6ca7cb6">Session 3</a>
<ul>
<li><a href="#orgcc63bf5">Exercise: Is there a correlation between industry institutional ownership and return on equity?</a></li>
</ul>
</li>
<li><a href="#orgdc0b093">Session 4</a>
<ul>
<li><a href="#org258329d">Exercise: What is the average on and off-peak real-time fuel mix?</a></li>
</ul>
</li>
<li><a href="#org08058e6">Session 5</a>
<ul>
<li><a href="#org8fd2915">Exercise: Where were the PPP loans made?</a></li>
</ul>
</li>
<li><a href="#org9d9caab">Session 6</a></li>
</ul>
</li>
<li><a href="#org4f107a1">Module 2: Numpy/Scipy and APIs</a>
<ul>
<li><a href="#org92d85a8">Session 7</a>
<ul>
<li><a href="#org66c5c12">Exercise: Pull stock data via API and estimate a Markowitz mean-variance optimal portfolio.</a></li>
<li><a href="#org92175b6">Alternative: Calculate futures prices given options (but we cant get this from API data).</a></li>
</ul>
</li>
<li><a href="#org5c2f05e">Session 8</a>
<ul>
<li><a href="#org493d16f">Exercise: Calculate market depth via Kyle's lambda. Use Coinbase API to get trades.</a></li>
</ul>
</li>
<li><a href="#org4223ffa">Session 9</a>
<ul>
<li><a href="#org1b1e5a0">Exercise: Deposit insurance valuation using (Merton's) option pricing method. (chapter 19, Merton's CTF)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdb3dd47">Module 3: Sharing Your Work</a>
<ul>
<li><a href="#org7234c6b">Session 10</a></li>
<li><a href="#org9700f74">Session 11</a></li>
<li><a href="#org2418870">Session 12</a></li>
</ul>
</li>
<li><a href="#org46ed16b">Bonus Material</a>
<ul>
<li><a href="#org6689fa1">Bonus Project: Predict Small Business Loans with a Deep Neural Network in Tensorflow</a></li>
<li><a href="#org44301ee">Bonus Project: Calculate Performance Measures for Various ETFs (Sharpe, Information ratios, etc)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The course is broadly divided into 4 modules, each with 3 to 4 sessions. There are also 2 bonus sessions.
</p>

<ul class="org-ul">
<li>Be sure to follow along in your copy of the Colab Notebooks.</li>
<li>You can always go back to the original Colab Notebooks using the links below.  So don't hesitate to modify your copy&#x2014;you learn best by experimenting.</li>
</ul>

<div id="outline-container-org03b3228" class="outline-2">
<h2 id="org03b3228">Introduction</h2>
<div class="outline-text-2" id="text-org03b3228">
<p>
<a href="https://youtu.be/fGNuZYlk0TA">Intro Video</a>
</p>
</div>
</div>

<div id="outline-container-org2cbdbea" class="outline-2">
<h2 id="org2cbdbea">Module 0: Setup</h2>
<div class="outline-text-2" id="text-org2cbdbea">
</div>
<div id="outline-container-orgb02b922" class="outline-3">
<h3 id="orgb02b922">Session 0</h3>
<div class="outline-text-3" id="text-orgb02b922">
<p>
<a href="https://youtu.be/1hSvSJblH5Q">Session Video</a>
</p>

<ul class="org-ul">
<li>Course Overview:  
<ul class="org-ul">
<li>What we will cover in the course.</li>
<li>The use of Python in finance.</li>
</ul></li>
<li>Python Relative to other tools.
<ul class="org-ul">
<li>Excel</li>
<li>Other Programming Languages</li>
<li>Comparison with R</li>
<li>Using Javascript for Visualization</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org78b3e96" class="outline-3">
<h3 id="org78b3e96">Session 1</h3>
<div class="outline-text-3" id="text-org78b3e96">
<p>
<a href="https://youtu.be/nssQNdjyiSQ">Session Video (Part 1) Colab Notebooks and Basic Arithmetic</a>
</p>

<p>
<a href="https://youtu.be/yUql_y6BZj4">Session Video (Part 2) Defining Functions and Data Types</a>
</p>

<p>
<a href="https://youtu.be/PZR7M0cRNwg">Exercise Solution Video</a>
</p>

<p>
<a href="https://colab.research.google.com/drive/1f2JRrZsZ029JNiPnP_GNiVsyi-e6MXO5">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Interacting with Python
<ul class="org-ul">
<li>Google's Colab and Jupyter
<ul class="org-ul">
<li>Introduction to markdown</li>
<li>Sharing notebooks</li>
</ul></li>
</ul></li>
<li>Intro to the Linux Server</li>
<li>Creating Functions and Time-Value-of-Money calculations</li>
<li>Basic control flow</li>
<li>The importance of indentation</li>
</ul>
</div>
</div>

<div id="outline-container-orgcc77efb" class="outline-3">
<h3 id="orgcc77efb">Session 2</h3>
<div class="outline-text-3" id="text-orgcc77efb">
<p>
<a href="https://youtu.be/6ne6TcRNzVw">Session Video</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=g8c3bxk_eJU">Exercise Solution Video</a>
</p>

<p>
<a href="https://colab.research.google.com/drive/12QKdTc3ulsEQ2cAdmbhq5RkTx9oB1YZ_">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Sharing code and the Python ecosystem.</li>
<li>Python Packages
<ul class="org-ul">
<li>Extending the core language</li>
<li>Our most used packages.</li>
<li>Installing and Loading.</li>
<li>How to call methods/functions from a package.</li>
<li>Package security.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc24d1bb" class="outline-2">
<h2 id="orgc24d1bb">Module 1: Pandas and Spreadsheet Data</h2>
<div class="outline-text-2" id="text-orgc24d1bb">
<p>
This module focuses on corporate finance related tasks.  Accordingly we read data from spreadsheet and <i>Dataframe</i> structures.
</p>
</div>

<div id="outline-container-org6ca7cb6" class="outline-3">
<h3 id="org6ca7cb6">Session 3</h3>
<div class="outline-text-3" id="text-org6ca7cb6">
<p>
<a href="https://youtu.be/fCfx-Ftr_w0">Session Video</a>
</p>

<p>
<a href="https://colab.research.google.com/drive/1KLqsQWbXHYSruQXBAJ1QamsxV9FLDN_R">Colab Notebook</a>
</p>
</div>

<div id="outline-container-orgcc63bf5" class="outline-4">
<h4 id="orgcc63bf5">Exercise: Is there a correlation between industry institutional ownership and return on equity?</h4>
<div class="outline-text-4" id="text-orgcc63bf5">
<ul class="org-ul">
<li>An intro to Pandas</li>
<li>Reading csv and excel files over http.</li>
<li>Data cleaning.</li>
<li>Inspecting the objects</li>
<li>Determining dataframe size and the column types.</li>
<li>Adding new columns</li>
<li>A note of functions vs methods.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdc0b093" class="outline-3">
<h3 id="orgdc0b093">Session 4</h3>
<div class="outline-text-3" id="text-orgdc0b093">
<p>
<a href="https://colab.research.google.com/drive/16UVjO2PEQUN5b1JoI__JYfj7K_aMuom7#scrollTo=nBbjWR1JYksh">Colab Notebook</a>
</p>
</div>

<div id="outline-container-org258329d" class="outline-4">
<h4 id="org258329d">Exercise: What is the average on and off-peak real-time fuel mix?</h4>
<div class="outline-text-4" id="text-org258329d">
<ul class="org-ul">
<li>Dates in Pandas.</li>
<li>Interacting with the operating system from Python.</li>
<li>Summarizing by creating group means, etc.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org08058e6" class="outline-3">
<h3 id="org08058e6">Session 5</h3>
<div class="outline-text-3" id="text-org08058e6">
<p>
<a href="https://colab.research.google.com/drive/18axbgTGt66R7fXa3tsiErQMoyb8m-AJD">Colab Notebook</a>
</p>
</div>

<div id="outline-container-org8fd2915" class="outline-4">
<h4 id="org8fd2915">Exercise: Where were the PPP loans made?</h4>
<div class="outline-text-4" id="text-org8fd2915">
<ul class="org-ul">
<li>Filtering DataFrames</li>
<li>Pivot Tables</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9d9caab" class="outline-3">
<h3 id="org9d9caab">Session 6</h3>
<div class="outline-text-3" id="text-org9d9caab">
<p>
<a href="https://colab.research.google.com/drive/1TWjqlgTp1Fyyy_ykp48LBVFWjRqtBwzo">Colab Notebook</a>
</p>

<p>
The previous sections have used data available online through APIs and flat files.  Commonly the financial analyst will have to query relational (SQL) databases.  In this section we'll cover the basics of connecting to a SQL database in Python, and executing SQL queries, and returning the data as a Pandas <i>DataFrame</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-org4f107a1" class="outline-2">
<h2 id="org4f107a1">Module 2: Numpy/Scipy and APIs</h2>
<div class="outline-text-2" id="text-org4f107a1">
<p>
This module focuses on using scientific computing libraries such as Numpy Scipy to complete investments-focused tasks. We also retrieve JSON data from APIs.
</p>
</div>

<div id="outline-container-org92d85a8" class="outline-3">
<h3 id="org92d85a8">Session 7</h3>
<div class="outline-text-3" id="text-org92d85a8">
<p>
<a href="https://colab.research.google.com/drive/16h1ykVWbb5fL-xRgOrYmYe9SqfrSin1x#scrollTo=4cmbxkCjM1fH">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>An introduction to Application Programming Interfaces (APIs) and online
data
<ul class="org-ul">
<li>Example: Coinbase API</li>
<li>Example: Interactive Brokers API</li>
<li>EIA API.</li>
</ul></li>
<li>Connecting to databases.</li>
</ul>
</div>

<div id="outline-container-org66c5c12" class="outline-4">
<h4 id="org66c5c12">Exercise: Pull stock data via API and estimate a Markowitz mean-variance optimal portfolio.</h4>
</div>
<div id="outline-container-org92175b6" class="outline-4">
<h4 id="org92175b6">Alternative: Calculate futures prices given options (but we cant get this from API data).</h4>
</div>
</div>

<div id="outline-container-org5c2f05e" class="outline-3">
<h3 id="org5c2f05e">Session 8</h3>
<div class="outline-text-3" id="text-org5c2f05e">
<p>
<a href="https://colab.research.google.com/drive/1GGXpVBhSIypRslVcjWB5TYcexeRxZlyY">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>An overview of scipy and basic statistics in Python.
<ul class="org-ul">
<li>Extracting coefficients from an estimated regression model.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org493d16f" class="outline-4">
<h4 id="org493d16f">Exercise: Calculate market depth via Kyle's lambda. Use Coinbase API to get trades.</h4>
<div class="outline-text-4" id="text-org493d16f">
</div>
</div>
</div>

<div id="outline-container-org4223ffa" class="outline-3">
<h3 id="org4223ffa">Session 9</h3>
<div class="outline-text-3" id="text-org4223ffa">
<p>
<a href="https://colab.research.google.com/drive/1u4BUOasPaIVfe8-rD73QXlXmt5EMIMxK">Colab Notebook</a>
</p>
</div>

<div id="outline-container-org1b1e5a0" class="outline-4">
<h4 id="org1b1e5a0">Exercise: Deposit insurance valuation using (Merton's) option pricing method. (chapter 19, Merton's CTF)</h4>
</div>
</div>
</div>


<div id="outline-container-orgdb3dd47" class="outline-2">
<h2 id="orgdb3dd47">Module 3: Sharing Your Work</h2>
<div class="outline-text-2" id="text-orgdb3dd47">
<p>
This module focuses on showcasing your work via visualizations, sharing code via git and GitHub.  We also cover reproducible environments.
</p>
</div>

<div id="outline-container-org7234c6b" class="outline-3">
<h3 id="org7234c6b">Session 10</h3>
<div class="outline-text-3" id="text-org7234c6b">
<p>
<a href="https://colab.research.google.com/drive/1CQ00H_duTY2lhiwzJ041JTPD6BGBdk5y#scrollTo=Z5RfT4TNucfe">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Visualization:
<ul class="org-ul">
<li>Matplotlib</li>
<li>Seaborn</li>
<li>Plotly</li>
<li>ggplot (using plotnine library)</li>
</ul></li>
<li>Interactive Web Apps via Plotly's Dash</li>
</ul>
</div>
</div>

<div id="outline-container-org9700f74" class="outline-3">
<h3 id="org9700f74">Session 11</h3>
<div class="outline-text-3" id="text-org9700f74">
<ul class="org-ul">
<li>The Integrated Development Environment (IDE)
<ul class="org-ul">
<li>What does an IDE provide?
<ul class="org-ul">
<li>Code Completion</li>
<li>Linter</li>
</ul></li>
<li>Git/Github and IDE Integration</li>
</ul></li>

<li>Virtual Environments
<ul class="org-ul">
<li>Ensuring compatible python and package versions.</li>
<li>Anaconda Python</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2418870" class="outline-3">
<h3 id="org2418870">Session 12</h3>
<div class="outline-text-3" id="text-org2418870">
<p>
<a href="https://colab.research.google.com/drive/1599E3ppEqm0Y0wAaMSm6CXWZtQW6fBNr#scrollTo=nAUGkiWESjX_">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Git/Github and IDE Integration
<ul class="org-ul">
<li>Why use version control?
<ul class="org-ul">
<li>Collaborate with others more easily.</li>
<li>Show others your work.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org46ed16b" class="outline-2">
<h2 id="org46ed16b">Bonus Material</h2>
<div class="outline-text-2" id="text-org46ed16b">
</div>
<div id="outline-container-org6689fa1" class="outline-3">
<h3 id="org6689fa1">Bonus Project: Predict Small Business Loans with a Deep Neural Network in Tensorflow</h3>
<div class="outline-text-3" id="text-org6689fa1">
<p>
<a href="https://colab.research.google.com/drive/1QUyAsBdFEoHqLUZduy9IeS7Er_lyczkU?usp=sharing">Colab Notebook</a>
</p>
</div>
</div>


<div id="outline-container-org44301ee" class="outline-3">
<h3 id="org44301ee">Bonus Project: Calculate Performance Measures for Various ETFs (Sharpe, Information ratios, etc)</h3>
<div class="outline-text-3" id="text-org44301ee">
<p>
<a href="https://colab.research.google.com/drive/1WT7Wb9o24JxoQVKN429MVYfBdE9UzzY8#scrollTo=ZpTjfSSiKh8P">Colab Notebook</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-09-05 Sun 21:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
